HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi_private.h
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_flash_spi_private.h
* Version      : 3.51
* Description  : FLASH SPI driver private header file
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 23.07.2014 2.21     Created
*              : 29.05.2015 2.32     Revised functions of same as Ver.2.32 of EEPROM SPI FIT module.
*              : 11.02.2019 3.00     Added parameter check of  Configuration Options.
*              : 10.12.2020 3.02     Fixed a bug that build does not pass due to #error 
*                                    when Flash of 1Gbit or more is selected.
*              : 31.12.2021 3.03     Added variable "read_after_write" "read_after_write_add" and
*                                    "read_after_write_data" for controlling SPI bus.
*              : 16.03.2023 3.20     Added support for AT25QF641B-SHB with Indirect Access Mode of QSPIX
*                                    Added support for QSPIX Memory Mapped Mode.
*              : 15.11.2023 3.40     Added support for reading across multiple banks in QSPIX Memory Mapped Mode.
*                                    Updated according to GSCE Code Checker 6.50.
*                                    Added support for MX25U6432F.
*                                    Added features Advanced sector protection supporting for MX66L1G45 and MX25U6432F.
*              : 15.03.2025 3.51     Updated disclaimer.
***********************************************************************************************************************/
#ifndef FLASH_SPI_PRIVATE_H
#define FLASH_SPI_PRIVATE_H


/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
/* FLASH driver flash memory type file */
#if   (FLASH_SPI_CFG_DEV0_MX25L == 1) || (FLASH_SPI_CFG_DEV0_MX66L == 1) || (FLASH_SPI_CFG_DEV0_MX25R == 1) || (FLASH_SPI_CFG_DEV0_MX25U == 1) || \
      (FLASH_SPI_CFG_DEV1_MX25L == 1) || (FLASH_SPI_CFG_DEV1_MX66L == 1) || (FLASH_SPI_CFG_DEV1_MX25R == 1) || (FLASH_SPI_CFG_DEV1_MX25U == 1)
#include "./src/flash_types/flash_mx/r_flash_spi_type_sub.h"
#elif (FLASH_SPI_CFG_DEV0_AT25QF == 1) || (FLASH_SPI_CFG_DEV1_AT25QF == 1)
#include "./src/flash_types/flash_at/r_flash_spi_type_sub.h"
#endif

/* FLASH driver port header file */
#include "./src/dev_port/r_flash_spi_dev_port.h"

/* MEMDRV driver header file and configuration file */
#include "r_memdrv_rx_if.h"
#include "r_memdrv_rx_config.h"

#if (FLASH_SPI_CFG_LONGQ_ENABLE == 1)
/* Use LONGQ driver header file. */
#include "r_longq_if.h"
#endif /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */


/*============================================================================*/
/*  Parameter check of  Configuration Options                              */
/*============================================================================*/

/* check of FLASH_SPI_CFG_DEVx_INCLUDED */
#if ((FLASH_SPI_CFG_DEV0_INCLUDED == 1 ) || ( FLASH_SPI_CFG_DEV1_INCLUDED == 1 ) )
#else
    #error "ERROR - One of the FLASH_SPI_CFG_DEVx_INCLUDED must be set. -  Parameter error in configures file."
#endif

/* Checking FLASH_SPI_CFG_DEV0_xxx is set*/
#if (FLASH_SPI_CFG_DEV0_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV0_INCLUDED == 1 ) && (( FLASH_SPI_CFG_DEV0_MX25L == 1 ) || (FLASH_SPI_CFG_DEV0_MX66L == 1) || (FLASH_SPI_CFG_DEV0_MX25R == 1) || (FLASH_SPI_CFG_DEV0_AT25QF == 1) || ( FLASH_SPI_CFG_DEV0_MX25U == 1))
#else
    #error "ERROR - One of the FLASH_SPI_CFG_DEV0_xxx must be set. -  Parameter error in configures file."
#endif

/* Checking FLASH_SPI_CFG_DEV1_xxx is set*/
#if (FLASH_SPI_CFG_DEV1_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV1_INCLUDED == 1 ) && (( FLASH_SPI_CFG_DEV1_MX25L == 1 ) || (FLASH_SPI_CFG_DEV1_MX66L == 1) || (FLASH_SPI_CFG_DEV1_MX25R == 1) || (FLASH_SPI_CFG_DEV1_AT25QF == 1) || (FLASH_SPI_CFG_DEV1_MX25U == 1))
#else
    #error "ERROR - One of the FLASH_SPI_CFG_DEV1_xxx must be set. -  Parameter error in configures file."
#endif

/* Check only one of FLASH_SPI_CFG_DEV0_xxx is set*/
#if (FLASH_SPI_CFG_DEV0_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV0_INCLUDED == 1 ) && ( \
   ( ( FLASH_SPI_CFG_DEV0_MX25L == 1 ) &&  (FLASH_SPI_CFG_DEV0_MX66L != 1) && (FLASH_SPI_CFG_DEV0_MX25R != 1) && (FLASH_SPI_CFG_DEV0_AT25QF != 1) && (FLASH_SPI_CFG_DEV0_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV0_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV0_MX66L == 1) && (FLASH_SPI_CFG_DEV0_MX25R != 1) && (FLASH_SPI_CFG_DEV0_AT25QF != 1) && (FLASH_SPI_CFG_DEV0_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV0_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV0_MX66L != 1) && (FLASH_SPI_CFG_DEV0_MX25R == 1) && (FLASH_SPI_CFG_DEV0_AT25QF != 1) && (FLASH_SPI_CFG_DEV0_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV0_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV0_MX66L != 1) && (FLASH_SPI_CFG_DEV0_MX25R != 1) && (FLASH_SPI_CFG_DEV0_AT25QF == 1) && (FLASH_SPI_CFG_DEV0_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV0_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV0_MX66L != 1) && (FLASH_SPI_CFG_DEV0_MX25R != 1) && (FLASH_SPI_CFG_DEV0_AT25QF != 1) && (FLASH_SPI_CFG_DEV0_MX25U == 1)))
#else
    #error "ERROR - Only One FLASH_SPI_CFG_DEV0_xxx can be set. -  Parameter error in configures file."
#endif

/* Check only one of FLASH_SPI_CFG_DEV1_xxx is set*/
#if (FLASH_SPI_CFG_DEV1_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV1_INCLUDED == 1 ) && ( \
   ( ( FLASH_SPI_CFG_DEV1_MX25L == 1 ) &&  (FLASH_SPI_CFG_DEV1_MX66L != 1) && (FLASH_SPI_CFG_DEV1_MX25R != 1) && (FLASH_SPI_CFG_DEV1_AT25QF != 1) && (FLASH_SPI_CFG_DEV1_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV1_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV1_MX66L == 1) && (FLASH_SPI_CFG_DEV1_MX25R != 1) && (FLASH_SPI_CFG_DEV1_AT25QF != 1) && (FLASH_SPI_CFG_DEV1_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV1_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV1_MX66L != 1) && (FLASH_SPI_CFG_DEV1_MX25R == 1) && (FLASH_SPI_CFG_DEV1_AT25QF != 1) && (FLASH_SPI_CFG_DEV1_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV1_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV1_MX66L != 1) && (FLASH_SPI_CFG_DEV1_MX25R != 1) && (FLASH_SPI_CFG_DEV1_AT25QF == 1) && (FLASH_SPI_CFG_DEV1_MX25U != 1)) || \
   ( ( FLASH_SPI_CFG_DEV1_MX25L != 1 ) &&  (FLASH_SPI_CFG_DEV1_MX66L != 1) && (FLASH_SPI_CFG_DEV1_MX25R != 1) && (FLASH_SPI_CFG_DEV1_AT25QF != 1) && (FLASH_SPI_CFG_DEV1_MX25U == 1)))
#else
    #error "ERROR - Only One FLASH_SPI_CFG_DEV1_xxx can be set. -  Parameter error in configures file."
#endif

/* Check only one of FLASH_SPI_CFG_DEV0_SIZE_xxx is set*/
#if (FLASH_SPI_CFG_DEV0_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV0_INCLUDED == 1 ) &&  (FLASH_SPI_CFG_DEV0_AT25QF != 1 ) && ( \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K == 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M == 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M == 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M == 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M == 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV0_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV0_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV0_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G == 1)))
#elif (FLASH_SPI_CFG_DEV0_INCLUDED == 1 ) &&  (FLASH_SPI_CFG_DEV0_AT25QF == 1 ) && (FLASH_SPI_CFG_DEV0_SIZE_64M == 1)
#else 
    #error "ERROR - Only One FLASH_SPI_CFG_DEV0_SIZE_xxx can be set. -  Parameter error in configures file."
#endif /* FLASH_SPI_CFG_DEV0_INCLUDED != 1  */

/* Check only one of FLASH_SPI_CFG_DEV1_SIZE_xxx is set*/
#if (FLASH_SPI_CFG_DEV1_INCLUDED != 1 )
#elif (FLASH_SPI_CFG_DEV1_INCLUDED == 1 ) &&  (FLASH_SPI_CFG_DEV1_AT25QF != 1 ) && ( \
    ((FLASH_SPI_CFG_DEV1_SIZE_512K == 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M == 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M == 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M == 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M == 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G != 1)) || \
     ((FLASH_SPI_CFG_DEV1_SIZE_512K != 1 ) &&  (FLASH_SPI_CFG_DEV1_SIZE_1M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_2M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_4M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_16M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_32M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_64M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_128M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_256M != 1) && \
     (FLASH_SPI_CFG_DEV1_SIZE_512M != 1) && (FLASH_SPI_CFG_DEV1_SIZE_1G == 1)))
#elif (FLASH_SPI_CFG_DEV1_INCLUDED == 1 ) &&  (FLASH_SPI_CFG_DEV1_AT25QF == 1 ) && (FLASH_SPI_CFG_DEV1_SIZE_64M == 1)
#else 
    #error "ERROR - Only One FLASH_SPI_CFG_DEV1_SIZE_xxx can be set. -  Parameter error in configures file."
#endif /* FLASH_SPI_CFG_DEV1_INCLUDED != 1  */

/************************************************************************************************
Macro definitions
*************************************************************************************************/
/* Definition of FLASH device number */
#if   (FLASH_SPI_CFG_DEV1_INCLUDED == 1)
    #define FLASH_SPI_DEV_NUM           (2)
#elif (FLASH_SPI_CFG_DEV0_INCLUDED == 1)
    #define FLASH_SPI_DEV_NUM           (1)
#else
    #define FLASH_SPI_DEV_NUM           (0)
#endif

/* Definition of unit of software wait timer */
#define FLASH_SPI_UINT_MICROSECS        ((uint8_t)(0))              /* Unit : us                            */
#define FLASH_SPI_UINT_MILLISECS        ((uint8_t)(1))              /* Unit : ms                            */

/* Access time */
#define FLASH_SPI_T_READY_WAIT          (FLASH_SPI_UINT_MILLISECS)  /* Write busy completion polling time   */
#define FLASH_SPI_T_CS_HOLD             (FLASH_SPI_UINT_MICROSECS)  /* CS stability waiting time            */
#define FLASH_SPI_T_R_ACCESS            (FLASH_SPI_UINT_MICROSECS)  /* Reading start waiting time           */

/* Definition of read max size */
#if   defined(FLASH_SPI_CFG_USE_FIT)
#define FLASH_SPI_R_DATA_SIZE           ((uint32_t)(0xffffffff))    /* Read Max size 4G-1 Bytes             */
#else
#define FLASH_SPI_R_DATA_SIZE           ((uint32_t)(0x00008000))    /* Read Max size 32K Bytes              */
#endif  /* #if   defined(FLASH_SPI_CFG_USE_FIT) */

/* Address Mode */
#define FLASH_SPI_MODE_3BYTE            ((uint8_t)(0))              /* 3-byte Address Mode                  */
#define FLASH_SPI_MODE_4BYTE            ((uint8_t)(1))              /* 4-byte Address Mode                  */

