HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi_private.h
/* Definitions of flash memory types */
#define FLASH_SPI_TYPE_NONE_MEMORY      ((uint32_t)(0x00000000))    /* None memory device                   */
#define FLASH_SPI_TYPE_MX25L            ((uint32_t)(0x00000001))    /* Macronix MX25L                       */
#define FLASH_SPI_TYPE_MX66L            ((uint32_t)(0x00000002))    /* Macronix MX66L                       */
#define FLASH_SPI_TYPE_MX25R            ((uint32_t)(0x00000004))    /* Macronix MX25R                       */
#define FLASH_SPI_TYPE_AT25QF           ((uint32_t)(0x00000008))    /* Adesto AT25QF                        */
#define FLASH_SPI_TYPE_MX25U            ((uint32_t)(0x00000010))    /* Macronix MX25U                       */

/* Address boundary */
#define FLASH_SPI_ADDR_BOUNDARY         ((uint32_t)(0x00000003))

/* Definition of read max size in a Bank Memory Map */
#define FLASH_SPI_R_DATA_QSPIX_BANK_SIZE    ((uint32_t)(0x4000000)) /* Read Max size 64 MBytes             */

/************************************************************************************************
Typedef definitions
*************************************************************************************************/
/* Enumeration for error log */
#if (FLASH_SPI_CFG_LONGQ_ENABLE == 1)                               /* Use LONGQ driver.                    */
#define FLASH_SPI_DRIVER_ID             ((uint32_t)(8))             /* FLASH debug log id                   */
#define FLASH_SPI_DEBUG_ERR_ID          ((uint32_t)(1))             /* FLASH debug log error id             */
typedef enum e_flash_log
{
    FLASH_SPI_USER       =  11,
    FLASH_SPI_TYPE       =  12,
    FLASH_SPI_TYPE_SUB   =  13,
} flash_logid_t;
#endif /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */


/************************************************************************************************
Exported global variables
*************************************************************************************************/


/************************************************************************************************
Exported global functions (to be accessed by other files)
*************************************************************************************************/
#if (FLASH_SPI_CFG_LONGQ_ENABLE == 1)
/* It is a function for debugging. When invalidate definition "FLASH_SPI_CFG_LONGQ_ENABLE",
   the code is not generated. */
uint32_t           r_flash_spi_log(uint32_t flg, uint32_t fid, uint32_t line);
#define R_FLASH_SPI_Log_Func(x, y, z)   (r_flash_spi_log((x), (y), (z))) /* define a function for debugging */
#else
#define R_FLASH_SPI_Log_Func(x, y, z)    /* define a empty */
#endif /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */

/* r_flash_spi_type.c */
/******************************************************************************
 * Function Name: r_flash_spi_init_port
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_init_port (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_reset_port
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_reset_port (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_read_status
 * Description  : .
 * Arguments    : devno
 *              : p_status
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_status (uint8_t devno, uint8_t * p_status);

/******************************************************************************
 * Function Name: r_flash_spi_set_write_protect
 * Description  : .
 * Arguments    : devno
 *              : wpsts
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_set_write_protect (uint8_t devno, uint8_t wpsts);

/******************************************************************************
 * Function Name: r_flash_spi_set_write_protect_advanced_sector
 * Description  : .
 * Arguments    : devno
 *              : flash_spi_protect_sector_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_set_write_protect_advanced_sector (uint8_t devno, flash_spi_protect_sector_info_t * flash_spi_protect_sector_info);

/******************************************************************************
 * Function Name: r_flash_spi_erase_write_protect_advanced_sector
 * Description  : .
 * Arguments    : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_erase_write_protect_advanced_sector (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_write_di
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_di (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_read_data
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_data (uint8_t devno, flash_spi_info_t * p_flash_spi_info);

/******************************************************************************
 * Function Name: r_flash_spi_write_data_page
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_data_page (uint8_t devno, flash_spi_info_t * p_flash_spi_info);

