HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi_private.h
/******************************************************************************
 * Function Name: r_flash_spi_erase
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_erase_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_erase (uint8_t devno, flash_spi_erase_info_t * p_flash_spi_erase_info);

/******************************************************************************
 * Function Name: r_flash_spi_polling
 * Description  : .
 * Arguments    : devno
 *              : mode
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_polling (uint8_t devno, flash_spi_poll_mode_t mode);

/******************************************************************************
 * Function Name: r_flash_spi_read_id
 * Description  : .
 * Arguments    : devno
 *              : p_data
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_id (uint8_t devno, uint8_t * p_data);

/******************************************************************************
 * Function Name: r_flash_spi_get_memory_info
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_mem_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_get_memory_info (uint8_t devno, flash_spi_mem_info_t * p_flash_spi_mem_info);

/******************************************************************************
 * Function Name: r_flash_spi_read_configuration
 * Description  : .
 * Arguments    : devno
 *              : p_config_reg
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_configuration (uint8_t devno, uint8_t * p_config_reg);

/******************************************************************************
 * Function Name: r_flash_spi_read_status2
 * Description  : .
 * Arguments    : devno
 *              : p_status
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_status2 (uint8_t devno, uint8_t * p_status);

/******************************************************************************
 * Function Name: r_flash_spi_read_status3
 * Description  : .
 * Arguments    : devno
 *              : p_status
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_status3 (uint8_t devno, uint8_t * p_status);

/******************************************************************************
 * Function Name: r_flash_spi_write_configuration
 * Description  : .
 * Arguments    : devno
 *              : p_reg
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_configuration (uint8_t devno, flash_spi_reg_info_t * p_reg);

/******************************************************************************
 * Function Name: r_flash_spi_write_status
 * Description  : .
 * Arguments    : devno
 *              : p_reg
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_status (uint8_t devno, uint8_t * p_reg);

/******************************************************************************
 * Function Name: r_flash_spi_write_status2
 * Description  : .
 * Arguments    : devno
 *              : p_reg
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_status2 (uint8_t devno, uint8_t * p_reg);

/******************************************************************************
 * Function Name: r_flash_spi_write_status3
 * Description  : .
 * Arguments    : devno
 *              : p_reg
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_status3 (uint8_t devno, uint8_t * p_reg);

/******************************************************************************
 * Function Name: r_flash_spi_read_security
 * Description  : .
 * Arguments    : devno
 *              : p_scur
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_security (uint8_t devno, uint8_t * p_scur);

/******************************************************************************
 * Function Name: r_flash_spi_read_data_security_page
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_read_data_security_page (uint8_t devno, flash_spi_info_t * p_flash_spi_info);

/******************************************************************************
 * Function Name: r_flash_spi_write_data_security_page
 * Description  : .
 * Arguments    : devno
 *              : p_flash_spi_info
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_write_data_security_page (uint8_t devno, flash_spi_info_t * p_flash_spi_info);

/******************************************************************************
 * Function Name: r_flash_spi_quad_enable
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_quad_enable (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_quad_disable
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_quad_disable (uint8_t devno);

