HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi_private.h
/******************************************************************************
 * Function Name: r_flash_spi_set_4byte_address_mode
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_set_4byte_address_mode (uint8_t devno);

/* r_flash_spi_drvif.c */
/******************************************************************************
 * Function Name: r_flash_spi_drvif_open
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_open_tx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open_tx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_open_rx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open_rx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_close
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_close_tx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close_tx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_close_rx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close_rx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_disable
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_disable (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_enable
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_enable_tx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable_tx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_enable_rx_data
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable_rx_data (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_tx
 * Description  : .
 * Arguments    : devno
 *              : txcnt
 *              : p_data
 *              : read_after_write
 *              : read_in_memory_mapped
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx (uint8_t devno, uint32_t txcnt, uint8_t * p_data,
                                        bool read_after_write, bool read_in_memory_mapped);


/******************************************************************************
 * Function Name: r_flash_spi_drvif_tx_add
 * Description  : .
 * Arguments    : devno
 *              : txcnt
 *              : p_data
 *              : op_mode
 *              : read_after_write_add
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx_add (uint8_t devno, uint32_t txcnt, uint8_t * p_data,
                                            flash_spi_opmode_t op_mode, bool read_after_write_add);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_tx_data
 * Description  : .
 * Arguments    : devno
 *              : txcnt
 *              : p_data
 *              : op_mode
 *              : read_after_write_data
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx_data (uint8_t devno, uint32_t txcnt, uint8_t * p_data,
                                             flash_spi_opmode_t op_mode, bool read_after_write_data);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_rx
 * Description  : .
 * Arguments    : devno
 *              : rxcnt
 *              : p_data
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx (uint8_t devno, uint32_t rxcnt, uint8_t * p_data);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_rx_add
 * Description  : .
 * Arguments    : devno
 *              : rxcnt
 *              : p_data
 *              : op_mode
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx_add (uint8_t devno, uint32_t rxcnt, uint8_t * p_data,

        flash_spi_opmode_t op_mode);

