HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi_private.h
/******************************************************************************
 * Function Name: r_flash_spi_drvif_rx_data
 * Description  : .
 * Arguments    : devno
 *              : rxcnt
 *              : p_data
 *              : p_addr
 *              : addr_size
 *              : op_mode
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx_data (uint8_t devno, uint32_t rxcnt, uint8_t * p_data,
                                         uint32_t p_addr, uint8_t addr_size, flash_spi_opmode_t op_mode);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_1ms_interval
 * Description  : .
 * Return Value : .
 *****************************************************************************/
void               r_flash_spi_drvif_1ms_interval (void);

/******************************************************************************
 * Function Name: r_flash_spi_drvif_set_loghdladdress
 * Description  : .
 * Argument     : user_long_que
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_drvif_set_loghdladdress (uint32_t user_long_que);


/* r_flash_spi_dev_port_iodefine.c or r_flash_spi_dev_port_gpio.c */
/******************************************************************************
 * Function Name: r_flash_spi_cs_init
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
void               r_flash_spi_cs_init (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_cs_reset
 * Description  : .
 * Argument     : devno
 * Return Value : .
 *****************************************************************************/
void               r_flash_spi_cs_reset (uint8_t devno);

/******************************************************************************
 * Function Name: r_flash_spi_set_cs
 * Description  : .
 * Arguments    : devno
 *              : lv
 * Return Value : .
 *****************************************************************************/
void               r_flash_spi_set_cs (uint8_t devno, uint8_t lv);

/******************************************************************************
 * Function Name: r_flash_spi_softwaredelay
 * Description  : .
 * Arguments    : delay
 *              : units
 * Return Value : .
 *****************************************************************************/
bool               r_flash_spi_softwaredelay (uint32_t delay, bsp_delay_units_t units);

/******************************************************************************
 * Function Name: r_flash_spi_wait_lp
 * Description  : .
 * Argument     : unit
 * Return Value : .
 *****************************************************************************/
flash_spi_status_t r_flash_spi_wait_lp (uint8_t unit);


#endif /* FLASH_SPI_PRIVATE_H */

/* End of File */
